app/controllers/microposts_controller.rb

	def create
		@micropost = current_user.microposts.build(micropost_params)
		@micropost.image.attach(params[:micropost][:image])
		if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello, Iam newbie"], ["user_id", 1], ["created_at", "2021-12-30 02:45:05.445791"], ["updated_at", "2021-12-30 02:45:05.445791"]]

		def correct_user
			@micropost = current_user.microposts.find_by(id: params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 301], ["LIMIT", 1]]