app/controllers/relationships_controller.rb

	def create
		user = User.find(params[:followed_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]