app/models/user.rb

  def self.from_omniauth(auth)
    result = User.where(email: auth.info.email).first
    if result
      return result
    else
      where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "datdobn58211@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest", "provider", "uid", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "625830401985732"], ["LIMIT", 1]]